<template>
    <my-page title="繁体字工具 - 帮助" backable>
        <ui-article class="article">
            <h2>应用说明</h2>
            <p>在聊天或者阅读某些文字时，有时会遇到一大段的繁体字，阅读起来比较吃力。这个工具可以帮到你。</p>
            <p>高级模式下，还支持文件的导入导出，方便把 TXT 格式的小说转成简体/繁体字。</p>
            <h2>注意</h2>
            <p>导入的文本文件只支持 UTF-8 编码，如果不是 UTF-8 编码的文件，会出现乱码的情况。</p>
            <p>Windows 自带的记事本修改文件编码的方法是：点击菜单【文件】->【另存为】，在【编码】那里选择【UTF-8】，再点击【保存】按钮。</p>
            <p>需要注意的是，由于浏览器的性能原因，对文件的大小有限制，太大的文件会造成浏览器卡死的现象。</p>
        </ui-article>
    </my-page>
</template>
